20260505T111446--kdoc-576-『ザ・ゴール』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-05-14T22:17:33Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 576: 『ザ・ゴール』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 576: 『ザ・ゴール』</h1>
<div id="outline-container-orgde0c09a" class="outline-2">
<h2 id="orgde0c09a"><a href="#orgde0c09a"><span class="done DONE">DONE</span> この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgde0c09a">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-05-09 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcfbe24a" class="outline-2">
<h2 id="orgcfbe24a"><a href="#orgcfbe24a">概要</a></h2>
<div class="outline-text-2" id="text-orgcfbe24a">
<p>
『ザ・ゴール』は、工場の生産管理の手法について、物語形式で説明する本である。
</p>
</div>
</div>
<div id="outline-container-orgcc6a17a" class="outline-2">
<h2 id="orgcc6a17a"><a href="#orgcc6a17a">メモ</a></h2>
<div class="outline-text-2" id="text-orgcc6a17a">
<ul class="org-ul">
<li>生産的であるということは、自己の目標と照らし合わせて何かを達成したということである(p58)
<ul class="org-ul">
<li>感想: ビジネスの目的は利益を得ることであるから、間違ったものを作ったら生産的ではない</li>
</ul></li>
<li>生産性は目標がはっきりわかっていなければまったく意味をもたない(p58)</li>
<li>純利益、投資収益率、キャッシュフローの3つを同時に増やすことで金を儲ける(p85)</li>
<li>スループットとは、販売を通じてお金を作り出す割合のこと(p102)</li>
<li>在庫とは、販売しようとするモノを購入するために投入したすべてのお金のこととする。会計の意味とは異なる(p103)</li>
<li>業務費用とは、在庫をスループットに変えるために費やすお金のこと(p103)</li>
<li>失ったお金はすべて業務費用で、売れる投資はすべて在庫になる(p126)</li>
<li>バランスをとらないといけないのは生産能力ではなくフロー(p233)</li>
<li>ボトルネックを通過するフローを市場からの需要に合わせる(p233)</li>
<li>ボトルネックがある場合、工場の能力はボトルネックの能力に等しい。だからボトルネックで1時間無駄にすると工場全体で1時間無駄になる(p264)</li>
<li>すぐに売れる見込みのないものを作って在庫を溜め込むことは、将来入ってくるお金のためにいまあるお金を犠牲にしていることになる(p266)</li>
<li>非ボトルネックを単純に最大限まで働かせることは愚の骨頂である。工場内のすべてのリソースの能力を個別に最大化してはならない。個別の最大化は全体的にはまったく最適なシステムではない(p345)</li>
<li>資材が工場を通過する時間は4つに分けられる(p377)
<ul class="org-ul">
<li>セットアップ</li>
<li>プロセスタイム</li>
<li>キュータイム</li>
<li>ウエイトタイム</li>
</ul></li>
<li>何も考えずに習慣どおりにしかできない人を説得するのに、答えをただ教えても非効率である(p435)</li>
<li>科学のアプローチ。最初にあまりデータの収集はせず、ランダムに事実を取り上げる。それか仮説を立てる。「もし〜ならば、〜になる」という考え方をする。物語の関連性を考える、がすべての基本である(p517)</li>
<li>目先の状況の改善策だけで満足するだけでなく、何をすべきか慎重に選んで、それに努力を集中させなければならない(p536)</li>
<li>マネージャーとして求められる3つの能力(p549)
<ul class="org-ul">
<li>何を変える</li>
<li>何に変える</li>
<li>どうやって変える</li>
</ul></li>
<li>従来の会計システムは、工場全体の生産量がボトルネックの生産能力以上にできないということを想定してない(p579)</li>
</ul>
</div>
</div>
<div id="outline-container-orgba0162d" class="outline-2">
<h2 id="orgba0162d"><a href="#orgba0162d">関連</a></h2>
<div class="outline-text-2" id="text-orgba0162d">
<ul class="org-ul">
<li>類推: 工場以外にもこの考え方は適用できるか</li>
<li>追加調査: 従来の会計システムの正しさの根拠はどこにあるか。会計が第一義とすることは何か。逆に向いてない分野はあるか</li>
<li>類推: Factorioなどの、工場系ゲームの副読本として役に立つだろう</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
